blogs/rpath_in_chroot.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-18 Wed 12:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>chroot 环境中使用带 RPATH 的程序</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">chroot 环境中使用带 RPATH 的程序</h1>

<div id="outline-container-org3f3bf55" class="outline-2">
<h2 id="org3f3bf55"><span class="section-number-2">1</span> java 如何支持安装多个版本</h2>
<div class="outline-text-2" id="text-1">
<p>
众所周知，同一台机器可以安装多个java版本，但java依赖的库并不是版本化的放在ldconfig可以识别的目录中的，而是借助RPATH，在编译时指定加载目录实现的。验证如下：
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ffff00;">## </span><span style="color: #ffff00;">java &#38656;&#35201; libjli.so</span>
<span style="color: #ffff00;"># </span><span style="color: #ffff00;">ldd /usr/lib/jvm/java-1.8.0-openjdk-1.8.0.222.b10-0.el7_6.x86_64/jre/bin/java</span>
  libjli.so =&gt; /usr/lib/jvm/java-1.8.0-openjdk-1.8.0.222.b10-0.el7_6.x86_64/jre/bin/../lib/amd64/jli/libjli.so (0x00007f80f83a1000)

<span style="color: #ffff00;">## </span><span style="color: #ffff00;">libjli.so &#19981;&#22312;&#38142;&#25509;&#36335;&#24452;&#37324;</span>
<span style="color: #ffff00;"># </span><span style="color: #ffff00;">ldconfig -p | grep libjli.so</span>

<span style="color: #ffff00;">## </span><span style="color: #ffff00;">libjli.so &#20986;&#29616;&#22312;&#20102;RPATH&#37324;&#65292;&#36825;&#37324; $ORIGIN &#25351;&#20195;java&#30340;&#36335;&#24452;&#65292;&#21487;&#20197;&#25226;so&#25918;&#21040;java&#30340;&#30456;&#23545;&#36335;&#24452;&#37324;</span>
<span style="color: #ffff00;"># </span><span style="color: #ffff00;">objdump -a -x /usr/lib/jvm/java-1.8.0-openjdk-1.8.0.222.b10-0.el7_6.x86_64/jre/bin/java  | grep RPATH</span>
  RPATH                $<span style="color: #ffff00;">ORIGIN</span>/../lib/amd64/jli:$<span style="color: #ffff00;">ORIGIN</span>/../lib/amd64
</pre>
</div>
</div>
</div>

<div id="outline-container-org38680b9" class="outline-2">
<h2 id="org38680b9"><span class="section-number-2">2</span> chroot 环境如何构建</h2>
<div class="outline-text-2" id="text-2">
<p>
chroot本质是把程序运行的根目录切到chroot的目录，只要程序在chroot目录启动时能找到相应的程序以及程序依赖的东西，那么chroot环境就可以了。找到程序很简单，它依赖的东西嘛，就比较费劲了。常见的依赖包括so，以及so所需要的配置文件，至于其它东西，就比较晦涩了。
</p>
</div>
<div id="outline-container-org38a36b6" class="outline-3">
<h3 id="org38a36b6"><span class="section-number-3">2.1</span> 构建一个通用的的chroot环境</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>mkdir -p jail/usr &amp;&amp; cp -a /usr/{lib64,bin,libexec} jail/usr &amp;&amp; cp -a /etc jail &amp;&amp; ln -sf /usr/lib64 jail/lib64 &amp;&amp; ln -sf /usr/bin jail/bin</code>
这样构造出的chroot环境，比较大，至少有500M。
</p>

<p>
缩小chroot环境的方法是只复制需要的文件，通常的步骤是找到二进制文件p，然后 <code>ldd p</code> 查看依赖哪些so，复制这些so。
<code>mkdir -p sjail/usr/{lib64,bin} &amp;&amp; cp /bin/{bash,ls} sjail/usr/bin &amp;&amp; ldd /bin/bash /bin/ls | grep -Po '/lib64/[^\s]+' | xargs -I'{}' cp '{}'  sjail/usr/lib64 &amp;&amp; ln -sf /usr/lib64 sjail/lib64</code>
这个chroot环境只有 <code>ls</code> 和 <code>bash</code> 两个命令，所以非常小，只有4M。
</p>
</div>
</div>

<div id="outline-container-org32a7cce" class="outline-3">
<h3 id="org32a7cce"><span class="section-number-3">2.2</span> 验证chroot环境是否正常</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>chroot jail bash -c "echo X"</code> 如果执行成功，则说明chroot环境的bash已经可以正常运行了。
</p>
</div>
</div>
</div>

<div id="outline-container-org81421a4" class="outline-2">
<h2 id="org81421a4"><span class="section-number-2">3</span> 如何把java放到chroot环境中</h2>
<div class="outline-text-2" id="text-3">
<p>
如法炮制，我构建了java的chroot环境，遗憾的是报错， <code>/usr/lib/jvm/java-1.8.0-openjdk-1.8.0.222.b10-0.el7_6.x86_64/jre/bin/java: error while loading shared libraries: libjli.so: cannot open shared object file: No such file or directory</code> 。找不到 <code>libjli.so</code> ，说明RPATH没生效，RPATH好像被忽略掉了。
</p>

<p>
<a href="https://github.com/daveagp/java_jail"><code>java_jail</code></a> 中提到了 <code>/proc</code> ，难免让人眼前一亮，RPATH中的$ORIGIN要想正常工作离不开/proc文件系统，利用strace验证一下：
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ffff00;"># </span><span style="color: #ffff00;">strace java -version 2&gt;&amp;1 | grep /proc</span>
<span style="color: #0000ff; font-weight: bold;">readlink</span>(<span style="color: #00ff00;">"/proc/self/exe"</span>, 0x7ffd965d3910, 4096) = -1 ENOENT (No such file or directory)
</pre>
</div>
<p>
为什么要读取 <code>/proc/self/exe</code> 呢，因为要获取java的位置，这样才能确定 $ORIGIN的值，RPATH 才能生效。
</p>

<p>
<code>/proc</code> 目录当然不能复制了，需要 <code>mount --bind -o ro,bind /proc $PWD/proc</code> 这样chroot和机器共享 <code>/proc</code> ，问题解决。
</p>
</div>

<div id="outline-container-org3d04560" class="outline-3">
<h3 id="org3d04560"><span class="section-number-3">3.1</span> 其它解决方法</h3>
<div class="outline-text-3" id="text-3-1">
<p>
既然RPATH不起作用，可以把 <code>libjli.so</code> 放到lib64 目录下，也可以使用 <code>LD_LIBRARY_PATH</code> 指定 <code>libjli.so</code> 的路径，这两种方法更简答，只是没有mount优雅。
</p>
</div>
</div>
</div>

<div id="outline-container-org096644c" class="outline-2">
<h2 id="org096644c"><span class="section-number-2">4</span> 更复杂的chroot环境</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://github.com/daveagp/java_jail"><code>java_jail</code> </a> 中除了提到proc，还提到了特殊的 <code>/dev</code> 文件，构建一个chroot环境，可能很简单，也可能很复杂，取决于在chroot环境中执行什么。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2020-03-18 Wed 12:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
